Autodesk.Revit.DB.Structure.LineLoad.Moment2
Returns the three dimensional moment applied to the end point of the line load.
Remarks:
The default force unit is kN-m/m for metric, and kip-ft/ft for imperial.

Autodesk.Revit.DB.Structure.LineLoad.Moment1
Returns the three dimensional moment applied to the start point of the line load.
Remarks:
The default force unit is kN-m/m for metric, and kip-ft/ft for imperial.

Autodesk.Revit.DB.Structure.LineLoad.Force2
Returns the three dimensional force applied to the end point of the line load.
Remarks:
The default force unit is kN/m for metric, and kip/ft for imperial.

Autodesk.Revit.DB.Structure.LineLoad.Force1
Returns the three dimensional force applied to the start point of the line load.
Remarks:
The default force unit is kN/m for metric, and kip/ft for imperial.

Autodesk.Revit.DB.Structure.LineLoad.ProjectedLoad
Indicates if the load is projected.
Remarks:
This parameter will take effect only if LineLoad.OrientTo property is set to LoadOrientTo.Project.

Autodesk.Revit.DB.Structure.LineLoad.UniformLoad
Indicates if the load is uniform.
Remarks:
Returns true if the line load is uniform, false otherwise.
Load is uniform when force and moment vectors assigned to the start and the end point of load are equal.